app/controllers/employees_controller.rb

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
  def show
    @employee = Employee.find(params[:id])

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
  def edit
    @employee = Employee.find(params[:id])

INSERT INTO `employees` (`created_at`, `name`, `salary`, `updated_at`) VALUES ('2013-04-16 13:14:17', 'Renat', '', '2013-04-16 13:14:17')
---
  def create
    @employee = Employee.new(params[:employee])

    respond_to do |format|
      if @employee.save

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
UPDATE `employees` SET `name` = 'Renato', `salary` = '781524', `updated_at` = '2013-04-16 13:14:26' WHERE `employees`.`id` = 1
---
  def update
    @employee = Employee.find(params[:id])

    respond_to do |format|
      if @employee.update_attributes(params[:employee])

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 2 LIMIT 1
DELETE FROM `employees` WHERE `employees`.`id` = 2
---
  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy